777SD/zfly/stm32/OLED详解/移植库/Hal库Code/OLED.c
#include "OLED.h"
#include "stm32f4xx_hal.h"
#include "gpio.h"
#include "OLED_FONT.H"

typedef enum
{ Bit_RESET= 0 ,
  Bit_SET
}BitAction;


//注意此驱动适用于0.96 OLED

#define OLED_W_SCL(x)		HAL_GPIO_WritePin(GPIOA, SCL_Pin, (BitAction)(x))
#define OLED_W_SDA(x)		HAL_GPIO_WritePin(GPIOA, SDA_Pin, (BitAction)(x))

void OLED_I2C_Start(void)
{
	OLED_W_SDA(1);
	OLED_W_SCL(1);
	OLED_W_SDA(0);
	OLED_W_SCL(0);
}

/**
  * @brief  I2C停止
  * @param   ???????
  * @retval  ???????
  */
void OLED_I2C_Stop(void)
{
	OLED_W_SDA(0);
	OLED_W_SCL(1);
	OLED_W_SDA(1);
}

/**
  * @brief  I2C发 ? 一个字 ???????
  * @param  Byte 要发送的 ???????个字 ???????
  * @retval  ???????
  */
void OLED_I2C_SendByte(uint8_t Byte)
{
	uint8_t i;
	for (i = 0; i < 8; i++)
	{
		OLED_W_SDA(Byte & (0x80 >> i));
		OLED_W_SCL(1);
		OLED_W_SCL(0);
	}
	OLED_W_SCL(1);	//额外的一个时钟，不处理应答信 ???????
	OLED_W_SCL(0);
}

/**
  * @brief  OLED写命 ???????
  * @param  Command 要写入的命令
  * @retval  ???????
  */
void OLED_WriteCommand(uint8_t Command)
{
	OLED_I2C_Start();
	OLED_I2C_SendByte(0x78);		//从机地址
	OLED_I2C_SendByte(0x00);		//写命 ???????
	OLED_I2C_SendByte(Command);
	OLED_I2C_Stop();
}

/**
  * @brief  OLED写数 ???????
  * @param  Data 要写入的数据
  * @retval  ???????
  */
void OLED_WriteData(uint8_t Data)
{
	OLED_I2C_Start();
	OLED_I2C_SendByte(0x78);		//从机地址
	OLED_I2C_SendByte(0x40);		//写数 ???????
	OLED_I2C_SendByte(Data);
	OLED_I2C_Stop();
}

/**
  * @brief  OLED设置光标位置
  * @param  Y 以左上角为原点，向下方向的坐标，范围 ???????0~7
  * @param  X 以左上角为原点，向右方向的坐标，范围 ???????0~127
  * @retval  ???????
  */
void OLED_SetCursor(uint8_t Y, uint8_t X)
{
	OLED_WriteCommand(0xB0 | Y);					//设置Y位置
	OLED_WriteCommand(0x10 | ((X & 0xF0) >> 4));	//设置X位置 ???????4 ???????
	OLED_WriteCommand(0x00 | (X & 0x0F));			//设置X位置 ???????4 ???????
}

/**
  * @brief  OLED清屏
  * @param   ???????
  * @retval  ???????
  */
void OLED_Clear(void)
{
	uint8_t i, j;
	for (j = 0; j < 8; j++)
	{
		OLED_SetCursor(j, 0);
		for(i = 0; i < 132; i++)
		{
			OLED_WriteData(0x00);
		}
	}
}

/**
  * @brief  OLED显示 ???????个字 ???????
  * @param  Line 行位置，范围 ???????1~4
  * @param  Column 列位置，范围 ???????1~16
  * @param  Char 要显示的 ???????个字符，范围：ASCII可见字符
  * @retval  ???????
  */
void OLED_ShowChar(uint8_t Line, uint8_t Column, char Char)
{
	uint8_t i;
	OLED_SetCursor((Line - 1) * 2, (Column - 1) * 8);		//设置光标位置在上半部 ???????
	for (i = 0; i < 8; i++)
	{
		OLED_WriteData(OLED_IIC_F8x16[Char - ' '][i]);			//显示上半部分内容
	}
	OLED_SetCursor((Line - 1) * 2 + 1, (Column - 1) * 8);	//设置光标位置在下半部 ???????
	for (i = 0; i < 8; i++)
	{
		OLED_WriteData(OLED_IIC_F8x16[Char - ' '][i + 8]);		//显示下半部分内容
	}
}

/**
  * @brief  OLED显示字符 ???????
  * @param  Line 起始行位置，范围 ???????1~4
  * @param  Column 起始列位置，范围 ???????1~16
  * @param  String 要显示的字符串，范围：ASCII可见字符
  * @retval  ???????
  */
void OLED_ShowString(uint8_t Line, uint8_t Column, char *String)
{
	uint8_t i;
	for (i = 0; String[i] != '\0'; i++)
	{
		OLED_ShowChar(Line, Column + i, String[i]);
	}
}

/**
  * @brief  OLED次方函数
  * @retval 返回值等于X的Y次方
  */
uint32_t OLED_Pow(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1;
	while (Y--)
	{
		Result *= X;
	}
	return Result;
}

/**
  * @brief  OLED显示数字（十进制，正数）
  * @param  Line 起始行位置，范围 ???????1~4
  * @param  Column 起始列位置，范围 ???????1~16
  * @param  Number 要显示的数字，范围：0~4294967295
  * @param  Length 要显示数字的长度，范围：1~10
  * @retval  ???????
  */
void OLED_ShowNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
	uint8_t i;
	for (i = 0; i < Length; i++)
	{
		OLED_ShowChar(Line, Column + i, Number / OLED_Pow(10, Length - i - 1) % 10 + '0');
	}
}

/**
  * @brief  OLED显示数字（十进制，带符号数）
  * @param  Line 起始行位置，范围 ???????1~4
  * @param  Column 起始列位置，范围 ???????1~16
  * @param  Number 要显示的数字，范围：-2147483648~2147483647
  * @param  Length 要显示数字的长度，范围：1~10
  * @retval  ???????
  */
void OLED_ShowSignedNum(uint8_t Line, uint8_t Column, int32_t Number, uint8_t Length)
{
	uint8_t i;
	uint32_t Number1;
	if (Number >= 0)
	{
		OLED_ShowChar(Line, Column, '+');
		Number1 = Number;
	}
	else
	{
		OLED_ShowChar(Line, Column, '-');
		Number1 = -Number;
	}
	for (i = 0; i < Length; i++)
	{
		OLED_ShowChar(Line, Column + i + 1, Number1 / OLED_Pow(10, Length - i - 1) % 10 + '0');
	}
}

/**
  * @brief  OLED显示数字（十六进制，正数 ???????
  * @param  Line 起始行位置，范围 ???????1~4
  * @param  Column 起始列位置，范围 ???????1~16
  * @param  Number 要显示的数字，范围：0~0xFFFFFFFF
  * @param  Length 要显示数字的长度，范围：1~8
  * @retval  ???????
  */
void OLED_ShowHexNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
	uint8_t i, SingleNumber;
	for (i = 0; i < Length; i++)
	{
		SingleNumber = Number / OLED_Pow(16, Length - i - 1) % 16;
		if (SingleNumber < 10)
		{
			OLED_ShowChar(Line, Column + i, SingleNumber + '0');
		}
		else
		{
			OLED_ShowChar(Line, Column + i, SingleNumber - 10 + 'A');
		}
	}
}

/**
  * @brief  OLED显示数字（二进制，正数）
  * @param  Line 起始行位置，范围 ???????1~4
  * @param  Column 起始列位置，范围 ???????1~16
  * @param  Number 要显示的数字，范围：0~1111 1111 1111 1111
  * @param  Length 要显示数字的长度，范围：1~16
  * @retval  ???????
  */
void OLED_ShowBinNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
{
	uint8_t i;
	for (i = 0; i < Length; i++)
	{
		OLED_ShowChar(Line, Column + i, Number / OLED_Pow(2, Length - i - 1) % 2 + '0');
	}
}

void OLED_ShowChinese(uint32_t Line,uint32_t Column,uint32_t Number)
{
	uint32_t i;
	OLED_SetCursor((Line-1)*2,(Column-1)*16);
	for(i = 0;i<16;i++)
	{
		OLED_WriteData(Font_Chinese[2*Number][i]);
	}
	OLED_SetCursor((Line-1)*2+1,(Column-1)*16);
	for(i =0;i<16;i++)
	{
		OLED_WriteData(Font_Chinese[2*Number+1][i]);
	}
}

/**
  * @brief  OLED初始 ???????
  * @param   ???????
  * @retval  ???????
  */
void OLED_Init(void)
{
	uint32_t i, j;

	for (i = 0; i < 1000; i++)			//上电延时
	{
		for (j = 0; j < 1000; j++);
	}

	MX_GPIO_Init();			//端口初始 ???????

	OLED_WriteCommand(0xAE);	//关闭显示

	OLED_WriteCommand(0xD5);	//设置显示时钟分频 ???????/振荡器频 ???????
	OLED_WriteCommand(0x80);

	OLED_WriteCommand(0xA8);	//设置多路复用 ???????
	OLED_WriteCommand(0x3F);

	OLED_WriteCommand(0xD3);	//设置显示偏移
	OLED_WriteCommand(0x00);

	OLED_WriteCommand(0x40);	//设置显示 ???????始行

	OLED_WriteCommand(0xA1);	//设置左右方向 ???????0xA1正常 0xA0左右反置

	OLED_WriteCommand(0xC8);	//设置上下方向 ???????0xC8正常 0xC0上下反置

	OLED_WriteCommand(0xDA);	//设置COM引脚硬件配置
	OLED_WriteCommand(0x12);

	OLED_WriteCommand(0x81);	//设置对比度控 ???????
	OLED_WriteCommand(0xCF);

	OLED_WriteCommand(0xD9);	//设置预充电周 ???????
	OLED_WriteCommand(0xF1);

	OLED_WriteCommand(0xDB);	//设置VCOMH取消选择级别
	OLED_WriteCommand(0x30);

	OLED_WriteCommand(0xA4);	//设置整个显示打开/关闭

	OLED_WriteCommand(0xA6);	//设置正常/倒转显示

	OLED_WriteCommand(0x8D);	//设置充电 ???????
	OLED_WriteCommand(0x14);

	OLED_WriteCommand(0xAF);	// ???????启显 ???????

	OLED_Clear();				//OLED清屏
}


